{
  "name": "Albert Cifuentes",
  "role": "Audio Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/Cifu2004",
  "linkedin": "https://www.linkedin.com/in/albert-cifuentes-bur%C3%A9s-835062366/",
  "translations": {
    "en": {
      "role": "Audio Programmer",
      "department": "Code",
      "bio": "As the audio programmer, I was responsible for implementing all the music and sound effects in the game. I used Wwise to organize and manage the audio, sorting everything into folders and soundbanks, and setting up different busses to separate the music and sound effects.\n\nTo improve the audio experience, I used several Wwise features like 3D spatialization, pitch and volume adjustments, random containers for variation, and share sets to keep things optimized, converting the files to Vorbis and setting the music to streaming mode to save memory and improve performance.\n\nAll audio events were triggered and controlled using Lua scripting, and in the engine I organized the audio objects in the hierarchy, adjusting their volumes and making sure everything was correctly connected.\n\nI also worked on finding or editing some of the audio clips using Audacity when necessary, and I guided the design team in the search for sounds to make sure everything fit the game properly. Besides that, I kept the Lua scripting documentation up to date and wrote the README files for every version we released.\n\nAt the beginning of development, I also helped a bit with the engine's input system and added some features to the player's godmode."
    },
    "es": {
      "role": "Programador de Audio",
      "department": "Código",
      "bio": "Como programador de audio, fui responsable de implementar toda la música y efectos de sonido en el juego. Utilicé Wwise para organizar y gestionar el audio, clasificándolo en carpetas y bancos de sonido, y configurando diferentes buses para separar la música de los efectos de sonido.\n\nPara mejorar la experiencia de audio, utilicé varias funciones de Wwise como espacialización 3D, ajustes de tono y volumen, contenedores aleatorios para variación y conjuntos compartidos para mantener la optimización, convirtiendo los archivos a Vorbis y configurando la música en modo de transmisión para ahorrar memoria y mejorar el rendimiento.\n\nTodos los eventos de audio fueron activados y controlados mediante scripting en Lua, y en el motor organicé los objetos de audio en la jerarquía, ajustando sus volúmenes y asegurándome de que todo estuviera correctamente conectado.\n\nTambién trabajé en la búsqueda y edición de algunos clips de audio usando Audacity cuando fue necesario, y guié al equipo de diseño en la búsqueda de sonidos para garantizar que todo encajara adecuadamente en el juego. Además, mantuve actualizada la documentación del scripting en Lua y escribí los archivos README para cada versión que lanzamos.\n\nAl comienzo del desarrollo, también ayudé un poco con el sistema de entrada del motor y agregué algunas funciones al modo dios del jugador."
    },
    "ca": {
      "role": "Programador d'Àudio",
      "department": "Codi",
      "bio": "Com a programador d'àudio, vaig ser responsable d'implementar tota la música i els efectes de so en el joc. Vaig utilitzar Wwise per organitzar i gestionar l'àudio, classificant-lo en carpetes i bancs de so, i configurant diferents busos per separar la música dels efectes de so.\n\nPer millorar l'experiència d'àudio, vaig utilitzar diverses funcions de Wwise com espacialització 3D, ajustaments de to i volum, contenidors aleatoris per a variació i conjunts compartits per mantenir l'optimització, convertint els fitxers a Vorbis i configurant la música en mode de transmissió per estalviar memòria i millorar el rendiment.\n\nTots els esdeveniments d'àudio es van activar i controlar mitjançant scripting en Lua, i en el motor vaig organitzar els objectes d'àudio en la jerarquia, ajustant-ne els volums i assegurant-me que tot estigués correctament connectat.\n\nTambé vaig treballar en la cerca i edició d'alguns clips d'àudio utilitzant Audacity quan va ser necessari, i vaig guiar l'equip de disseny en la cerca de sons per garantir que tot encaixés adequadament en el joc. A més, vaig mantenir actualitzada la documentació del scripting en Lua i vaig escriure els fitxers README per a cada versió que vam llançar.\n\nAl començament del desenvolupament, també vaig ajudar una mica amb el sistema d'entrada del motor i vaig afegir algunes funcions al mode déu del jugador."
    }
  },
  "skills": ["C#", "Unity UI", "React", "Frontend Development"],
  "works": []
}