{
  "name": "Albert Cifuentes",
  "role": "Audio Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/Cifu2004",
  "linkedin": "https://www.linkedin.com/in/albert-cifuentes-bur%C3%A9s-835062366/",
  "translations": {
    "en": {
      "role": "Audio Programmer",
      "department": "Code",
      "bio": "As the audio programmer, I was responsible for implementing all the music and sound effects in the game. I used Wwise to organize and manage the audio, sorting everything into folders and Soundbanks and setting up different Buses to separate the music and sound effects.\n\nTo improve the audio experience, I used several Wwise features like 3D Spatialization, pitch and volume adjustments, random containers for variation, and Sharesets to keep things optimized, converting the files to Vorbis and setting the music to streaming mode to save memory and improve performance.\n\nAll Audio Events were triggered and controlled using Lua scripting, and in the engine I organized the Audio Sources in the hierarchy, adjusting their volumes and making sure everything was correctly implemented.\n\nI also worked on finding and/or editing some of the audio clips using Audacity when necessary, and I guided the design team in the search for sounds to make sure everything fit the game properly. Besides that, I kept the Lua scripting documentation up to date and wrote the README files for every version we released.\n\nAt the beginning of development, I also helped a bit with the engine's input system and added some features to the player's GodMode."
    },
    "es": {
      "role": "Programador de Audio",
      "department": "Código",
      "bio": "Como programador de audio, he sido el responsable de implementar toda la música y los efectos de sonido del juego. He usado Wwise para organizar y gestionar los audios, ordenándolo todo en carpetas y Soundbanks, y configurando diferentes Buses para separar la música de los efectos de sonido.\n\nPara mejorar la experiencia sonora, he usado varias funciones de Wwise como la espacialización 3D, ajustes de tono (pitch) y volumen, Random Containers para dar variedad y Sharesets para mantener todo optimizado, convirtiendo los archivos a formato Vorbis y la música a modo streaming para ahorrar memoria y mejorar el rendimiento.\n\nTodos los Audio Events se activan y controlan mediante scripting en Lua. Dentro del motor, he organizado los Audio Sources en la jerarquía, he ajustado sus volúmenes y me he asegurado de que todo esté correctamente implementado.\n\nAdemás, he buscado y/o editado algunos clips de sonido con Audacity cuando fue necesario, y he guiado al equipo de diseño en la búsqueda de sonidos para asegurarme de que todo encajara bien en el juego. También he mantenido al día la documentación del scripting en Lua y he redactado los archivos README para cada versión del juego que hemos publicado.\n\nAl principio del desarrollo, también colaboré un poco con el sistema de input del motor y añadí algunas funciones al GodMode del jugador."
    },
    "ca": {
      "role": "Programador d'Àudio",
      "department": "Codi",
      "bio": "Com a programador d'àudio, he estat el responsable d'implementar tota la música i els efectes de so del joc. He utilitzat Wwise per organitzar i gestionar els àudios, ordenant-ho tot en carpetes i Soundbanks, i configurant diferents Busos per separar la música dels efectes de so.\n\nPer millorar l'experiència sonora, he fet servir diverses funcions de Wwise com l'espacialització 3D, ajustos de to (pitch) i volum, Random Containers per aportar varietat i Sharesets per mantenir-ho tot optimitzat, convertint els arxius a format Vorbis i posant la música en mode streaming per estalviar memòria i millorar el rendiment.\n\nTots els Audio Events s'activen i es controlen mitjançant scripting en Lua. Dins del motor, he organitzat els Audio Sources en la jerarquia, n'he ajustat els volums i m'he assegurat que tot estigués correctament implementat.\n\nA més, he cercat i/o editat alguns clips de so amb Audacity quan ha estat necessari, i he guiat l'equip de disseny en la cerca de sons per assegurar-me que tot encaixés bé en el joc. També he mantingut al dia la documentació del scripting en Lua i he redactat els arxius README per a cada versió del joc que hem publicat.\n\nA l'inici del desenvolupament, també vaig col·laborar una mica amb el sistema d'input del motor i vaig afegir algunes funcions al GodMode del jugador."
    }
  },
  "skills": ["C#", "Unity UI", "React", "Frontend Development"],
  "works": []
}