{
  "name": "Nicolás Sort",
  "role": "Gameplay Designer, Audio Designer",
  "department": "Design",
  "icon": "avatar.webp",
  "github": "https://github.com/nsortsauquillo",
  "linkedin": "https://www.linkedin.com/in/nsortsauquillo/",
  "portfolio": "https://nsortsauquillo.github.io/",
  "translations": {
    "en": {
      "role": "Gameplay Designer, Audio Designer",
      "department": "Design",
      "bio": "In this project, I was responsible for the full design of the main character. I defined their gameplay, visual identity, and overall integration within the game world. I designed the majority of the character's audio effects, making sure they aligned with the gameplay and the game's aesthetic tone. I also created several particle effects myself to enhance the character's visual feedback. Additionally, I handled the balancing of the character's stats to support fair and engaging gameplay. I actively participated in QA sessions throughout development to identify issues, refine mechanics, and polish the final experience."
    },
    "es": {
      "role": "Diseñador de Jugabilidad, Diseñador de Audio",
      "department": "Diseño",
      "bio": "En este proyecto, fui responsable del diseño completo del personaje principal. Definí la jugabilidad, identidad visual e integración general dentro del mundo del juego. Diseñé la mayoría de los efectos de sonido del personaje, asegurándome de que estuvieran alineados con la jugabilidad y el tono estético del juego. También creé varios efectos de partículas para mejorar la retroalimentación visual del personaje. Además, me encargué de equilibrar las estadísticas del personaje para garantizar una jugabilidad justa y atractiva. Participé activamente en sesiones de QA durante el desarrollo para identificar problemas, refinar mecánicas y pulir la experiencia final."
    },
    "ca": {
      "role": "Dissenyador de Jugabilitat, Dissenyador d'Àudio",
      "department": "Disseny",
      "bio": "En aquest projecte, vaig ser responsable del disseny complet del personatge principal. Vaig definir la jugabilitat, identitat visual i integració general dins del món del joc. Vaig dissenyar la majoria dels efectes de so del personatge, assegurant-me que estiguessin alineats amb la jugabilitat i el to estètic del joc. També vaig crear diversos efectes de partícules per millorar la retroalimentació visual del personatge. A més, vaig equilibrar les estadístiques del personatge per garantir una jugabilitat justa i atractiva. Vaig participar activament en sessions de QA durant el desenvolupament per identificar problemes, refinar mecàniques i polir l'experiència final."
    }
  },

  "task": ["Character Design", "Audio Design", "Game Balancing", "QA Testing"],
   "picfoot": ["Enemy Blood Particle System","Main Character Level 1 Running Particle System","Bolter Rifle Skill Charge Particle System"],
  "pics": ["nicolas_sort1.gif", "nicolas_sort2.gif", "nicolas_sort3.gif"]
}