{
  "name": "Rodrigo Álvarez",
  "role": "Enemy Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/Rodrigomoize",
  "linkedin": "https://www.linkedin.com/in/rodrigo-%C3%A1lvarez-moiz%C3%A9-2657212b2/",
  "translations": {
    "en": {
      "role": "Enemy Programmer",
      "department": "Code",
      "bio": "In this project, I focused on developing the enemy AI and acquiring knowledge of Lua, as this was the language we used. My main task was programming the Support enemy from start to finish, and I contributed, albeit to a lesser extent, to the design of other enemies. For example, I was responsible for the initial iteration of the tank enemy and played a supporting role during the first three iterations of the boss enemy. I am very satisfied with the work done and the results obtained. I feel this experience has significantly improved my understanding of enemy programming and how to approach it in the context of such an ambitious project. I thoroughly enjoyed this process and look forward to following a similar path in the future."
    },
    "es": {
      "role": "Programador de Enemigos",
      "department": "Código",
      "bio": "En este proyecto, me enfoqué en el desarrollo de la IA de los enemigos y en la adquisición de conocimientos de Lua, ya que fue el lenguaje que utilizamos. Mi tarea principal fue programar el enemigo de apoyo de principio a fin, y también contribuí, aunque en menor medida, al diseño de otros enemigos. Por ejemplo, fui responsable de la iteración inicial del enemigo tanque y desempeñé un papel de apoyo durante las primeras tres iteraciones del enemigo jefe. Estoy muy satisfecho con el trabajo realizado y los resultados obtenidos. Siento que esta experiencia ha mejorado significativamente mi comprensión de la programación de enemigos y cómo abordarla en el contexto de un proyecto tan ambicioso. Disfruté mucho este proceso y espero seguir un camino similar en el futuro."
    },
    "ca": {
      "role": "Programador d'Enemics",
      "department": "Codi",
      "bio": "En aquest projecte, em vaig centrar en el desenvolupament de la IA dels enemics i en l'adquisició de coneixements de Lua, ja que va ser el llenguatge que vam utilitzar. La meva tasca principal va ser programar l'enemic de suport de principi a fi, i també vaig contribuir, encara que en menor mesura, al disseny d'altres enemics. Per exemple, vaig ser responsable de la primera iteració de l'enemic tanc i vaig tenir un paper de suport durant les primeres tres iteracions de l'enemic cap. Estic molt satisfet amb la feina realitzada i els resultats obtinguts. Sento que aquesta experiència ha millorat significativament la meva comprensió de la programació d'enemics i com abordar-la en el context d'un projecte tan ambiciós. Vaig gaudir molt aquest procés i espero seguir un camí similar en el futur."
    }
  },
  "skills": ["Lua", "Enemy AI", "Game Programming", "Scripting"],
  "pics": ["rodrigo_alvarez1.mp4", "rodrigo_alvarez2.mp4", "rodrigo_alvarez3.mp4"]
}