{
  "name": "Pau Blanco",
  "role": "Animator, Concept Artist, Environment Artist",
  "department": "Art",
  "icon": "avatar.webp",
  "github": "https://github.com/PauloWhite2004",
  "linkedin": "https://www.linkedin.com/in/pau-blanco-valle-b0a224360/",
  "portfolio": "https://www.artstation.com/xxraptorxx2366",
  "translations": {
    "en": {
      "role": "Animator, Concept Artist, Environment Artist",
      "department": "Art",
      "bio": "In this project, I was mainly responsible for the artistic design of enemies, creation of props for the levels, and animations. I designed several iterations for enemies such as the Tank, Boss, and Miniboss. Later on, I also created props and tileable textures. Finally, in the latest iterations, I have done all the animations for the Tank and the introduction cutscene for Level 3. In conclusion, I would say that what I enjoyed the most in this project was the enemy concept art and the animations."
    },
    "es": {
      "role": "Animador, Artista Conceptual, Artista de Entornos",
      "department": "Arte",
      "bio": "En este proyecto, fui principalmente responsable del diseño artístico de los enemigos, la creación de accesorios para los niveles y la animación. Diseñé varias iteraciones para enemigos como el Tanque, el Jefe y el Mini-jefe. Más adelante, también creé accesorios y texturas enlosables. Finalmente, en las últimas iteraciones, realicé todas las animaciones del Tanque y la escena introductoria del Nivel 3. En conclusión, diría que lo que más disfruté en este proyecto fue el arte conceptual de los enemigos y las animaciones."
    },
    "ca": {
      "role": "Animador, Artista Conceptual, Artista d'Entorns",
      "department": "Art",
      "bio": "En aquest projecte, vaig ser principalment responsable del disseny artístic dels enemics, la creació d'accessoris per als nivells i l'animació. Vaig dissenyar diverses iteracions per a enemics com el Tank, el Cap i el Mini-cap. Més endavant, també vaig crear accessoris i textures enlosables. Finalment, en les últimes iteracions, vaig fer totes les animacions del Tank i l'escena introductòria del Nivell 3. En conclusió, diria que el que més vaig gaudir en aquest projecte va ser l'art conceptual dels enemics i les animacions."
    }
  },

  "task": ["Enemies & Props Concepts","Environment Art","Enemies animations"],
  "picfoot": ["Tank Attack Animation","Tank Berserk Mode Animation","Intro Level 3 Cinematic","Concept of the Statues of HiveCity","Tank Detection Animation","Tank Diying Animation","Tank Idle Animation","Concept of the Mount of the MiniBoss","Tank Stune Animation","Tank Tackle Animation","Tank Walk Animation"],
  "pics": ["pau_blanco1.mp4", "pau_blanco2.mp4", "pau_blanco3.mp4", "pau_blanco4.webp", "pau_blanco5.mp4", "pau_blanco6.mp4", "pau_blanco7.mp4", "pau_blanco8.webp", "pau_blanco9.mp4", "pau_blanco10.mp4", "pau_blanco11.mp4"]
}