{
  "name": "Adrià Roger",
  "role": "Enemy Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/Adri1714",
  "linkedin": "https://www.linkedin.com/in/adria-roger-0b5899196/",
  "portfolio": "https://adri1714.github.io/",
  "translations": {
    "en": {
      "role": "Enemy Programmer",
      "department": "Code",
      "bio": "As a programmer, I was mainly working on the enemy systems. Before that, I worked on explosion physics, the BulletPool system, and I also helped with the public scripting variables and the scripting documentation.\n\nIn the enemies department, my main task was the Ranged Enemy, although I also started working on the MiniBoss. However, the MiniBoss was cancelled after a bit of progress. When I joined the Ranged Enemy task, it was already started, so I added new features like a return-to-origin system (which was later used in other enemies), improvements to the detection system, and I added new animations. After that, I focused on fixing bugs in all enemies and improving how they worked.\n\nOne of the most important things I learned from this project was how teamwork really works. During the development, my work was connected to what others were doing, and the same happened with their work and mine. Because of that, I saw how important it is to have good communication and understand each other in order to make the project go well."
    },
    "es": {
      "role": "Programador de Enemigos",
      "department": "Código",
      "bio": "Como programador, trabajé principalmente en los sistemas de enemigos. Antes de eso, trabajé en la física de explosiones, el sistema BulletPool y también ayudé con las variables públicas de scripting y la documentación de scripting.\n\nEn el departamento de enemigos, mi tarea principal fue el Enemigo a Distancia, aunque también comencé a trabajar en el MiniBoss. Sin embargo, el MiniBoss fue cancelado después de un poco de progreso. Cuando me uní a la tarea del Enemigo a Distancia, ya había comenzado, por lo que agregué nuevas características como un sistema de retorno al origen (que luego se utilizó en otros enemigos), mejoras en el sistema de detección y nuevas animaciones. Después de eso, me enfoqué en corregir errores en todos los enemigos y mejorar su funcionamiento.\n\nUna de las cosas más importantes que aprendí de este proyecto fue cómo funciona realmente el trabajo en equipo. Durante el desarrollo, mi trabajo estaba conectado con lo que otros estaban haciendo, y lo mismo ocurría con su trabajo y el mío. Debido a eso, vi lo importante que es tener una buena comunicación y comprenderse mutuamente para que el proyecto avance bien."
    },
    "ca": {
      "role": "Programador d'Enemics",
      "department": "Codi",
      "bio": "Com a programador, vaig treballar principalment en els sistemes d'enemics. Abans d'això, vaig treballar en la física d'explosions, el sistema BulletPool i també vaig ajudar amb les variables públiques de scripting i la documentació de scripting.\n\nEn el departament d'enemics, la meva tasca principal va ser l'Enemic a Distància, tot i que també vaig començar a treballar en el MiniBoss. No obstant això, el MiniBoss va ser cancel·lat després d'un petit progrés. Quan em vaig unir a la tasca de l'Enemic a Distància, ja havia començat, així que vaig afegir noves característiques com un sistema de retorn a l'origen (que més tard es va utilitzar en altres enemics), millores en el sistema de detecció i noves animacions. Després d'això, em vaig centrar en corregir errors en tots els enemics i millorar-ne el funcionament.\n\nUna de les coses més importants que vaig aprendre d'aquest projecte va ser com funciona realment el treball en equip. Durant el desenvolupament, la meva feina estava connectada amb el que feien els altres, i el mateix passava amb la seva feina i la meva. Per això, vaig veure com és d'important tenir una bona comunicació i entendre's mútuament per tal que el projecte avanci bé."
    }
  },
  "skills": ["HLSL", "Shader Programming", "Visual Effects", "Graphics Programming"],
  "picfoot": ["Scripting Documentation on the Engine Web", "Scripting vector variables showing", "Physics Explosion", "Enemy Return functionality","Bullets and Range logic"],
  "pics": ["adria_roger1.webp", "adria_roger2.webp", "adria_roger3.webp", "adria_roger4.webm", "adria_roger5.webm"]
  
  
}