{
  "name": "Eduardo Bergillos",
  "role": "Enemy Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/eduardobr33",
  "linkedin": "https://www.linkedin.com/in/eduardo-bergillos-rivas-57a324222/",
  "portfolio": "https://eduardobr33.github.io",
  "translations": {
    "en": {
      "role": "Enemy Programmer",
      "department": "Code",
      "bio": "As the Main Enemy Programmer, I was responsible for leading and coordinating the enemy programming team. I managed task distribution and oversight to ensure consistency and efficiency across all enemy-related systems. I developed the base enemy class used as a foundation for all enemy behaviors. I also implemented the initial versions of the core enemy types, laying the groundwork for the logic, movement, and interactions. While other team members later expanded upon and refined these enemies, I remained involved throughout the process, providing technical guidance, support, and code reviews. I was fully in charge of the Final Boss development. This included implementing all of its phases, mechanics, abilities, and animations. Beyond enemy programming, I supported game releases, and maintained constant communication with other departments, particularly Design, Audio, and Art, to align implementation efforts. Additionally, I assisted with the design of the healing particle and made its implementation, I assisted with the integration of enemy audio, and I was fully in charge of implementing all VFX and particle systems related to enemies, managing their activation, synchronization, and gameplay feedback."
    },
    "es": {
      "role": "Programador de Enemigos",
      "department": "Código",
      "bio": "Como Programador Principal de Enemigos, fui responsable de liderar y coordinar el equipo de programación de enemigos. Gestioné la distribución de tareas y la supervisión para garantizar la coherencia y eficiencia en todos los sistemas relacionados con los enemigos. Desarrollé la clase base de enemigos que sirvió como fundamento para todos los comportamientos enemigos. También implementé las primeras versiones de los tipos de enemigos principales, estableciendo la lógica, el movimiento y las interacciones. Mientras otros miembros del equipo ampliaron y refinaron estos enemigos posteriormente, me mantuve involucrado en todo el proceso, proporcionando orientación técnica, apoyo y revisión de código. Estuve completamente a cargo del desarrollo del Jefe Final, lo que incluyó la implementación de todas sus fases, mecánicas, habilidades y animaciones. Más allá de la programación de enemigos, apoyé los lanzamientos del juego y mantuve una comunicación constante con otros departamentos, particularmente Diseño, Audio y Arte, para coordinar los esfuerzos de implementación. Además, ayudé en el diseño y la implementación de la partícula de curación, colaboré en la integración del audio de los enemigos y fui responsable de implementar todos los sistemas de VFX y partículas relacionados con los enemigos, gestionando su activación, sincronización y respuesta visual en el juego."
    },
    "ca": {
      "role": "Programador d'Enemics",
      "department": "Codi",
      "bio": "Com a Programador Principal d'Enemics, vaig ser responsable de liderar i coordinar l'equip de programació d'enemics. Vaig gestionar la distribució de tasques i la supervisió per garantir la coherència i l'eficiència en tots els sistemes relacionats amb els enemics. Vaig desenvolupar la classe base d'enemics que va servir com a fonament per a tots els comportaments enemics. També vaig implementar les primeres versions dels tipus d'enemics principals, establint la lògica, el moviment i les interaccions. Mentre altres membres de l'equip ampliaven i refinaven aquests enemics posteriorment, em vaig mantenir involucrat en tot el procés, proporcionant orientació tècnica, suport i revisió de codi. Vaig estar completament a càrrec del desenvolupament del Cap Final, que va incloure la implementació de totes les seves fases, mecàniques, habilitats i animacions. Més enllà de la programació d'enemics, vaig donar suport als llançaments del joc i vaig mantenir una comunicació constant amb altres departaments, particularment Disseny, Àudio i Art, per coordinar els esforços d'implementació. A més, vaig ajudar en el disseny i la implementació de la partícula de curació, vaig col·laborar en la integració de l'àudio dels enemics i vaig ser responsable d'implementar tots els sistemes de VFX i partícules relacionats amb els enemics, gestionant-ne l'activació, sincronització i resposta visual en el joc."
    }
  },

  "task": ["Enemy Design & Implementation","Ranged Enemy","Support Enemy","Kamikaze Enemy","Tank Enemy","Final Boss Enemy","Enemies Systems Support","Enemies particles/VFX","Final Boss Cinematics Integration","Game Release Execution"],
  "picfoot": ["General Enemies","Enemy Kamikaze","Enemy Ranged","Enemy Support","Enemy Tank","Final Boss"],
  "pics": ["eduardo_bergillos1.webm", "eduardo_bergillos2.mp4", "eduardo_bergillos3.mp4", "eduardo_bergillos4.mp4", "eduardo_bergillos5.mp4", "eduardo_bergillos6.webm"]
}