{
  "name": "Miguel Iglesias",
  "role": "Level Designer, Audio Designer",
  "department": "Design",
  "icon": "avatar.webp",
  "github": "https://github.com/MiguelIglesiasAbarca",
  "linkedin": "https://www.linkedin.com/in/miguel-iglesias-abarca",
  "translations": {
    "en": {
      "role": "Level Designer, Audio Designer",
      "department": "Design",
      "bio": "I began by focusing on level design, where I was responsible for creating levels 1, 2, and 3. This included building 3D blockouts to define spatial layout and gameplay flow, as well as integrating placeholders to establish early visual references and guide development. I also shaped a difficulty curve that provided a balanced and engaging progression, which was refined through multiple QA-driven iterations.\n\nIn parallel, I worked on setting up the 3D NavMesh to ensure smooth and coherent navigation for AI agents throughout the environments. This was key to maintaining believable enemy behavior and fluid gameplay.\n\nBeyond level design, I was responsible for designing and implementing audio elements that enriched the atmosphere, while creating custom particle effects to enhance visual feedback, aiming to match the tone and rhythm of gameplay while improving clarity and player satisfaction.\n\nThroughout development, I played a major role in QA, actively participating in numerous testing sessions. I focused especially on environment consistency and gamefeel, identifying and resolving issues that could hinder immersion, pacing, or player responsiveness."
    },
    "es": {
      "role": "Diseñador de Niveles, Diseñador de Audio",
      "department": "Diseño",
      "bio": "Comencé enfocándome en el diseño de niveles, donde fui responsable de crear los niveles 1, 2 y 3. Esto incluyó la construcción de blockouts en 3D para definir la disposición espacial y el flujo de juego, así como la integración de marcadores visuales para establecer referencias tempranas y guiar el desarrollo. También definí una curva de dificultad equilibrada y atractiva, que fue refinada a lo largo de múltiples iteraciones impulsadas por QA.\n\nParalelamente, trabajé en la configuración del 3D NavMesh para asegurar una navegación fluida y coherente para los agentes de IA en los entornos. Esto fue clave para mantener un comportamiento creíble en los enemigos y una jugabilidad fluida.\n\nMás allá del diseño de niveles, fui responsable de diseñar e implementar los elementos de audio que enriquecían la atmósfera, además de crear efectos de partículas personalizados para mejorar la retroalimentación visual, con el objetivo de adaptar el tono y el ritmo del juego mientras mejoraba la claridad y la satisfacción del jugador.\n\nDurante el desarrollo, desempeñé un papel importante en QA, participando activamente en numerosas sesiones de prueba. Me enfoqué especialmente en la coherencia del entorno y la sensación del juego, identificando y resolviendo problemas que pudieran afectar la inmersión, el ritmo o la capacidad de respuesta del jugador."
    },
    "ca": {
      "role": "Dissenyador de Nivells, Dissenyador d'Àudio",
      "department": "Disseny",
      "bio": "Vaig començar centrant-me en el disseny de nivells, on vaig ser responsable de crear els nivells 1, 2 i 3. Això va incloure la construcció de blockouts en 3D per definir la disposició espacial i el flux de joc, així com la integració de marcadors visuals per establir referències inicials i guiar el desenvolupament. També vaig definir una corba de dificultat equilibrada i atractiva, que es va refinar a través de múltiples iteracions impulsades per QA.\n\nEn paral·lel, vaig treballar en la configuració del 3D NavMesh per assegurar una navegació fluida i coherent per als agents d'IA en els entorns. Això va ser clau per mantenir un comportament creïble en els enemics i una jugabilitat fluida.\n\nMés enllà del disseny de nivells, vaig ser responsable de dissenyar i implementar els elements d'àudio que enriquien l'atmosfera, a més de crear efectes de partícules personalitzats per millorar la retroalimentació visual, amb l'objectiu d'adaptar el to i el ritme del joc mentre millorava la claredat i la satisfacció del jugador.\n\nDurant el desenvolupament, vaig tenir un paper important en QA, participant activament en nombroses sessions de prova. Em vaig centrar especialment en la coherència de l'entorn i la sensació del joc, identificant i resolent problemes que poguessin afectar la immersió, el ritme o la capacitat de resposta del jugador."
    }
  },

  "skills": ["Game Design", "Multiplayer Design", "Social Systems", "Monetization"],
  "works": []
}