{
  "name": "Aleix Botella",
  "role": "Player Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/Aleix3",
  "linkedin": "https://www.linkedin.com/in/aleix-botella-llobet-11a336339/",
  "translations": {
    "en": {
      "role": "Player Programmer",
      "department": "Code",
      "bio": "My work has been almost entirely focused on Main Character programming. I developed the complete player logic, including movement, orientation, bullet management, and the implementation of the dual weapon system (Bolter and Shotgun). I also created an AnimationManager to handle all 31 player animations, with blending between torso and leg animations. Additionally, I implemented the abilities: Grenade, Electric Zone, and Sword Push.\n\nI handled the integration of all player in-game art assets, including 3D models, VFX, and particle systems. I implemented logic to control when and how these assets appear, animate, or react in-game, making sure they are synchronized with the gameplay and the player actions.\n\nI was also responsible for all player interactions with the environment, as well as the integration with enemy logic, UI systems, and other related components.\n\nBeyond the player, I developed the in-game camera system. This includes smooth player following, joystick-based rotation, both manual and automatic zoom (which activates in the Boss Arena or Coliseum), and the camera shake effect.\n\nFinally, during the last development iterations, in addition to refining and polishing the player features, I implemented the full tutorial system and provided support across various other tasks."
    },
    "es": {
      "role": "Programador del Jugador",
      "department": "Código",
      "bio": "Mi trabajo se ha centrado casi por completo en la programación del Personaje Principal. Desarrollé la lógica completa del jugador, incluyendo movimiento, orientación, gestión de balas y la implementación del sistema de armas duales (Bolter y Escopeta). También creé un AnimationManager para manejar las 31 animaciones del jugador, con mezcla entre animaciones de torso y piernas. Además, implementé las habilidades: Granada, Zona Eléctrica y Empuje con Espada.\n\nMe encargué de la integración de todos los activos artísticos del jugador en el juego, incluyendo modelos 3D, efectos visuales y sistemas de partículas. Implementé la lógica para controlar cuándo y cómo estos activos aparecen, se animan o reaccionan en el juego, asegurándome de que estén sincronizados con la jugabilidad y las acciones del jugador.\n\nTambién fui responsable de todas las interacciones del jugador con el entorno, así como de la integración con la lógica de los enemigos, los sistemas de UI y otros componentes relacionados.\n\nMás allá del jugador, desarrollé el sistema de cámara del juego. Esto incluye el seguimiento fluido del jugador, la rotación basada en joystick, el zoom manual y automático (que se activa en la Arena del Jefe o el Coliseo) y el efecto de sacudida de cámara.\n\nFinalmente, durante las últimas iteraciones de desarrollo, además de refinar y pulir las características del jugador, implementé el sistema de tutorial completo y brindé apoyo en diversas otras tareas."
    },
    "ca": {
      "role": "Programador del Jugador",
      "department": "Codi",
      "bio": "La meva feina s'ha centrat gairebé completament en la programació del Personatge Principal. Vaig desenvolupar la lògica completa del jugador, incloent-hi el moviment, l'orientació, la gestió de bales i la implementació del sistema d'armes duals (Bolter i Escopeta). També vaig crear un AnimationManager per gestionar les 31 animacions del jugador, amb combinació entre animacions de tors i cames. A més, vaig implementar les habilitats: Granada, Zona Elèctrica i Empenta amb Espasa.\n\nEm vaig encarregar de la integració de tots els recursos artístics del jugador en el joc, incloent-hi models 3D, VFX i sistemes de partícules. Vaig implementar la lògica per controlar quan i com aquests recursos apareixen, s'animen o reaccionen en el joc, assegurant-me que estiguin sincronitzats amb la jugabilitat i les accions del jugador.\n\nTambé vaig ser responsable de totes les interaccions del jugador amb l'entorn, així com de la integració amb la lògica dels enemics, els sistemes d'UI i altres components relacionats.\n\nMés enllà del jugador, vaig desenvolupar el sistema de càmera en el joc. Això inclou el seguiment suau del jugador, la rotació basada en el joystick, el zoom manual i automàtic (que s'activa en l'Arena del Cap o el Colisseu) i l'efecte de tremolor de la càmera.\n\nFinalment, durant les últimes iteracions de desenvolupament, a més de refinar i polir les característiques del jugador, vaig implementar el sistema de tutorial complet i vaig oferir suport en diverses altres tasques."
    }
  },

  "task": ["Player System Support","Player Movement and orientation","Player shooting","Player aiming and autoAim help","InGameCamera(smooth, shake, zoomOut)","Player guns(bolter and shotgun)","Player Abilities","Player Animations system logic","Tutorial"],
  "picfoot": ["ElectricZone","General Player","Granade","MeleeAttack","PlayerMovement","PlayerShooting"],
  "pics": ["aleix_botella1.webm", "aleix_botella2.gif", "aleix_botella3.webm", "aleix_botella4.webm", "aleix_botella5.webm", "aleix_botella6.gif"]
}