{
  "name": "Guillem Alqueza",
  "role": "Engine Programmer, Gameplay Programmer, Audio Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/guillemalqueza",
  "linkedin": "https://www.linkedin.com/in/guillemalqueza/",
  "portfolio": "https://guillemalqueza.github.io/",
  "translations": {
    "en": {
      "role": "Engine Programmer, Gameplay Programmer, Audio Programmer",
      "department": "Code",
      "bio": "During the development of this project, I worked as one of the programmers of Coffee Engine, contributing to several core systems of both the engine and the game. I was responsible for the implementation of key modules, including: Audio Module: integrating Wwise with 3D audio, event-driven sound management, RTCPs, auxiliary busses, and profiler support. Animation System: Supporting skeletal animation, blending, and partial blending. UI Module: Includes features like anchors, stretching, transform handling, color customization, and spritesheet animation. It supports various interface elements such as images, buttons, toggles, sliders and text, offering a flexible and dynamic UI creation workflow. Navigation System: Generates navigation meshes from geometry and provides pathfinding algorithms, accessible through scripting for easy integration in gameplay. On the gameplay side, I developed the Save and Load System, including checkpoint management and persistent save data. I also developed interactive mechanics such as doors and levers. Beyond feature development, I focused heavily on performance optimization, for both the engine and the game. This involved using tools like Tracy Profiler, optimizing frustum culling and other systems, and improving assets, resources and script performance. I also actively participated in code reviews. Throughout the project, I provided continuous bug fixing support across multiple engine systems and gameplay scripts, ensuring stability and polish in the final game."
    },
    "es": {
      "role": "Programador de Motor, Programador de Jugabilidad, Programador de Audio",
      "department": "Código",
      "bio": "Durante el desarrollo de este proyecto, trabajé como uno de los programadores de Coffee Engine, contribuyendo a varios sistemas clave tanto del motor como del juego. Fui responsable de la implementación de módulos esenciales, incluyendo: Módulo de Audio: integrando Wwise con audio 3D, gestión de sonido basada en eventos, RTCPs, buses auxiliares y soporte de perfilador. Sistema de Animación: soporte para animaciones esqueléticas, blending y blending parcial. Módulo de UI: incluye funciones como anclajes, estiramiento, manejo de transformaciones, personalización de colores y animación de spritesheets. Admite varios elementos de interfaz como imágenes, botones, interruptores, deslizadores y texto, proporcionando un flujo de trabajo flexible y dinámico para la creación de UI. Sistema de Navegación: genera mallas de navegación a partir de geometría y ofrece algoritmos de pathfinding, accesibles a través de scripting para facilitar la integración en la jugabilidad. En el lado de la jugabilidad, desarrollé el Sistema de Guardado y Carga, incluyendo la gestión de puntos de control y datos de guardado persistentes. También desarrollé mecánicas interactivas como puertas y palancas. Más allá del desarrollo de funciones, me enfoqué en la optimización de rendimiento, tanto para el motor como para el juego. Esto implicó el uso de herramientas como Tracy Profiler, la optimización de frustum culling y otros sistemas, además de mejorar los recursos, activos y el rendimiento de los scripts. También participé activamente en revisiones de código. A lo largo del proyecto, brindé soporte continuo para la corrección de errores en múltiples sistemas del motor y scripts de jugabilidad, asegurando estabilidad y pulido en el juego final."
    },
    "ca": {
      "role": "Programador de Motor, Programador de Jugabilitat, Programador d'Àudio",
      "department": "Codi",
      "bio": "Durant el desenvolupament d'aquest projecte, vaig treballar com un dels programadors de Coffee Engine, contribuint a diversos sistemes clau tant del motor com del joc. Vaig ser responsable de la implementació de mòduls essencials, incloent-hi: Mòdul d'Àudio: integrant Wwise amb àudio 3D, gestió de so basada en esdeveniments, RTCPs, busos auxiliars i suport de perfilador. Sistema d'Animació: suport per a animacions esquelètiques, blending i blending parcial. Mòdul d'UI: inclou funcions com ancoratges, estirament, maneig de transformacions, personalització de colors i animació de spritesheets. Admet diversos elements d'interfície com imatges, botons, interruptors, lliscadors i text, proporcionant un flux de treball flexible i dinàmic per a la creació d'UI. Sistema de Navegació: genera malles de navegació a partir de geometria i ofereix algorismes de pathfinding, accessibles a través de scripting per facilitar la integració en la jugabilitat. En el costat de la jugabilitat, vaig desenvolupar el Sistema de Guardat i Càrrega, incloent-hi la gestió de punts de control i dades de guardat persistents. També vaig desenvolupar mecàniques interactives com portes i palanques. Més enllà del desenvolupament de funcions, em vaig centrar en l'optimització del rendiment, tant per al motor com per al joc. Això va implicar l'ús d'eines com Tracy Profiler, l'optimització de frustum culling i altres sistemes, a més de millorar els recursos, actius i el rendiment dels scripts. També vaig participar activament en revisions de codi. Al llarg del projecte, vaig oferir suport continu per a la correcció d'errors en múltiples sistemes del motor i scripts de jugabilitat, assegurant estabilitat i poliment en el joc final."
    }
  },

  "skills": ["C#", "Unity", "Engine Programming", "Audio Integration"],
  "works": []
}