{
  "name": "Lluc Cid",
  "role": "Level Designer, UI/UX Designer, Audio Designer",
  "department": "Design",
  "icon": "avatar.webp",
  "github": "https://github.com/username",
  "linkedin": "https://www.linkedin.com/in/lluc-cid-i-bernal-193843251/",
  "translations": {
    "en": {
      "role": "Level Designer, UI/UX Designer, Audio Designer",
      "department": "Design",
      "bio": "First, I started by designing the user interface alongside the user experience (UI/UX), ensuring it was intuitive, functional, and visually consistent with the project's overall vision.\n\nAfter that, I focused on level design, developing levels 1, 2, and 3. In this phase, I paid special attention to the type and quantity of enemies to implement, based on the guidelines provided by the enemy design department. Additionally, I worked on defining a proper difficulty curve to maintain a balanced yet challenging progression. This aspect went through continuous iteration during QA sessions, allowing us to fine-tune and polish the gameplay experience.\n\nOnce that phase was completed, I moved on to post-processing the interface, optimizing visual elements to enhance the final presentation of the game. I also took charge of designing and creating the audio elements, ensuring each sound contributed meaningfully to the atmosphere and gameplay. Lastly, I dedicated time to creating particle effects and spent considerable effort on multiple QA iterations, with a strong focus on refining and improving the overall quality of the product."
    },
    "es": {
      "role": "Diseñador de Niveles, Diseñador de UI/UX, Diseñador de Audio",
      "department": "Diseño",
      "bio": "Primero, comencé diseñando la interfaz de usuario junto con la experiencia de usuario (UI/UX), asegurándome de que fuera intuitiva, funcional y visualmente coherente con la visión general del proyecto.\n\nDespués de eso, me enfoqué en el diseño de niveles, desarrollando los niveles 1, 2 y 3. En esta fase, presté especial atención al tipo y cantidad de enemigos a implementar, basado en las directrices proporcionadas por el departamento de diseño de enemigos. Además, trabajé en definir una curva de dificultad adecuada para mantener una progresión equilibrada pero desafiante. Este aspecto pasó por iteraciones continuas durante las sesiones de QA, permitiéndonos ajustar y pulir la experiencia de juego.\n\nUna vez completada esa fase, pasé al postprocesado de la interfaz, optimizando los elementos visuales para mejorar la presentación final del juego. También me encargué de diseñar y crear los elementos de audio, asegurando que cada sonido contribuyera de manera significativa a la atmósfera y la jugabilidad. Por último, dediqué tiempo a crear efectos de partículas y realicé múltiples iteraciones de QA con un fuerte enfoque en la refinación y mejora de la calidad general del producto."
    },
    "ca": {
      "role": "Dissenyador de Nivells, Dissenyador de UI/UX, Dissenyador d'Àudio",
      "department": "Disseny",
      "bio": "Primer, vaig començar dissenyant la interfície d'usuari juntament amb l'experiència d'usuari (UI/UX), assegurant-me que fos intuïtiva, funcional i visualment coherent amb la visió general del projecte.\n\nDesprés d'això, em vaig centrar en el disseny de nivells, desenvolupant els nivells 1, 2 i 3. En aquesta fase, vaig prestar especial atenció al tipus i quantitat d'enemics a implementar, basant-me en les directrius proporcionades pel departament de disseny d'enemics. A més, vaig treballar per definir una corba de dificultat adequada per mantenir una progressió equilibrada però desafiant. Aquest aspecte va passar per iteracions contínues durant les sessions de QA, permetent-nos ajustar i polir l'experiència de joc.\n\nUn cop completada aquesta fase, vaig passar al postprocessament de la interfície, optimitzant els elements visuals per millorar la presentació final del joc. També em vaig encarregar de dissenyar i crear els elements d'àudio, assegurant-me que cada so contribuís de manera significativa a l'atmosfera i la jugabilitat. Finalment, vaig dedicar temps a crear efectes de partícules i vaig realitzar múltiples iteracions de QA amb un fort enfocament en la refinació i millora de la qualitat general del producte."
    }
  },

  "skills": ["Game Design", "Narrative Design", "Level Design", "Scripting"],
  "pics": ["lluc_cid1.webp", "lluc_cid2.webp", "lluc_cid3.webp"]
}