{
  "name": "Marta Jover",
  "role": "Environment Artist, Concept Artist, Branding Artist",
  "department": "Art",
  "icon": "avatar.webp",
  "github": "https://github.com/martagnarta",
  "linkedin": "https://www.linkedin.com/in/marta-jover-valero-6a4979185/",
  "portfolio": "https://martajvalero.com",
  "translations": {
    "en": {
      "role": "Environment Artist, Concept Artist, Branding Artist",
      "department": "Art",
      "bio": "In this project, I worked as an Environment Artist, contributing both to the Concept Art of elements that would later become in-game props, as well as creating the 3D props themselves. I was responsible for conceptualizing, modeling, and texturing various 3D assets for Warhammer 40,000: The Last Marine.\n\nTowards the end of the development, I took charge of all branding art for Burned Games, including designing the logo, T-shirts, and promotional covers for Play Testing. Additionally, I developed the studio's website from scratch, ensuring it reflected the identity and aesthetic of the project and the company.\n\nThis project allowed me to work across different creative disciplines—from world-building and asset production to branding and web design—giving me a holistic view of game development and the visual coherence behind a gaming experience."
    },
    "es": {
      "role": "Artista de Entornos, Artista Conceptual, Artista de Marca",
      "department": "Arte",
      "bio": "En este proyecto, trabajé como Artista de Entornos, contribuyendo tanto al Arte Conceptual de elementos que luego se convertirían en props del juego, como creando los props 3D en sí mismos. Fui responsable de conceptualizar, modelar y texturizar varios assets 3D para Warhammer 40,000: The Last Marine.\n\nHacia el final del desarrollo, me hice cargo de todo el arte de marca para Burned Games, incluyendo el diseño del logo, camisetas y portadas promocionales para las pruebas de juego. Además, desarrollé la página web del estudio desde cero, asegurándome de que reflejara la identidad y estética del proyecto y la empresa.\n\nEste proyecto me permitió trabajar en diferentes disciplinas creativas—desde la construcción de mundos y producción de assets hasta el branding y diseño web—dándome una visión holística del desarrollo de videojuegos y la coherencia visual detrás de una experiencia de juego."
    },
    "ca": {
      "role": "Artista d'Entorns, Artista Conceptual, Artista de Marca",
      "department": "Art",
      "bio": "En aquest projecte, vaig treballar com a Artista d'Entorns, contribuint tant a l'Art Conceptual d'elements que després es convertirien en props del joc, com creant els props 3D en si mateixos. Vaig ser responsable de conceptualitzar, modelar i texturitzar diversos assets 3D per a Warhammer 40,000: The Last Marine.\n\nCap al final del desenvolupament, em vaig fer càrrec de tot l'art de marca per a Burned Games, incloent el disseny del logo, samarretes i portades promocionals per a les proves de joc. A més, vaig desenvolupar la pàgina web de l'estudi des de zero, assegurant-me que reflectís la identitat i estètica del projecte i l'empresa.\n\nAquest projecte em va permetre treballar en diferents disciplines creatives—des de la construcció de mons i producció d'assets fins al branding i disseny web—donant-me una visió holística del desenvolupament de videojocs i la coherència visual darrere d'una experiència de joc."
    }
  },

  "task": ["Concept Art","Environment Art","Arte de Marca","Web Programming"],
  "picfoot": ["",""],
  "pics": []
}