{
  "name": "Guillem Alqueza",
  "role": "Engine Programmer, Gameplay Programmer, Audio Programmer",
  "department": "Code",
  "icon": "avatar.webp",
  "github": "https://github.com/guillemalqueza",
  "linkedin": "https://www.linkedin.com/in/guillemalqueza/",
  "portfolio": "https://guillemalqueza.github.io/",
  "translations": {
    "en": {
      "role": "Engine Programmer, Gameplay Programmer, Audio Programmer",
      "department": "Code",
      "bio": "During the development of this project, I worked as one of the programmers of Coffee Engine, contributing to several **core systems** of both the engine and the game.\n\nI was responsible for the implementation of key modules, including:\n\n- **Audio Module**: Integrating Wwise with 3D audio, event-driven sound management, RTCPs, auxiliary busses, and profiler support.\n- **Animation System**: Supporting skeletal animation, blending, and partial blending.\n- **UI Module**: Includes features like anchors, stretching, transform handling, color customization, and spritesheet animation. It supports various interface elements such as images, buttons, toggles, sliders, and text, offering a flexible and dynamic UI creation workflow.\n- **Navigation System**: Generates navigation meshes from geometry and provides pathfinding algorithms, accessible through scripting for easy integration in gameplay.\n\nOn the gameplay side, I developed the **Save and Load System**, including checkpoint management and persistent save data. I also developed interactive mechanics such as doors and levers.\n\nBeyond feature development, I focused heavily on **performance optimization** for both the engine and the game. This involved using tools like Tracy Profiler, optimizing frustum culling and other systems, and improving assets, resources, and script performance. I also actively participated in **code reviews**.\n\nThroughout the project, I provided continuous **bug fixing support** across multiple engine systems and gameplay scripts, ensuring stability and polish in the final game."
    },
    "es": {
      "role": "Programador de Motor, Programador de Jugabilidad, Programador de Audio",
      "department": "Código",
      "bio": "Durante el desarrollo de este proyecto, trabajé como uno de los programadores de Coffee Engine, contribuyendo a varios **sistemas clave** tanto del motor como del juego.\n\nFui responsable de la implementación de módulos esenciales, incluyendo:\n\n- **Módulo de Audio**: Integrando Wwise con audio 3D, gestión de sonido basada en eventos, RTCPs, buses auxiliares y soporte de perfilador.\n- **Sistema de Animación**: Soporte para animaciones esqueléticas, blending y blending parcial.\n- **Módulo de UI**: Incluye funciones como anclajes, stretching, manejo de transformaciones, personalización de colores y animación de spritesheets. Admite varios elementos de interfaz como imágenes, botones, toggles, sliders y texto, proporcionando un flujo de trabajo flexible y dinámico para la creación de UI.\n- **Sistema de Navegación**: Genera mallas de navegación a partir de geometría y ofrece algoritmos de pathfinding, accesibles a través de scripting para facilitar la integración en el juego.\n\nEn el lado del juego, desarrollé el **Sistema de Guardado y Carga**, incluyendo la gestión de puntos de control y datos de guardado persistentes. También desarrollé mecánicas interactivas como puertas y palancas.\n\nMás allá del desarrollo de funciones, me enfoqué en la **optimización de rendimiento** tanto para el motor como para el juego. Esto implicó el uso de herramientas como Tracy Profiler, la optimización de frustum culling y otros sistemas, además de mejorar el rendimiento de los recursos, assets y scripts. También participé activamente en **revisiones de código**.\n\nA lo largo del proyecto, brindé soporte continuo para la **corrección de errores** en múltiples sistemas del motor y scripts del juego, asegurando estabilidad y pulido en el juego final."
    },
    "ca": {
      "role": "Programador de Motor, Programador de Jugabilitat, Programador d'Àudio",
      "department": "Codi",
      "bio": "Durant el desenvolupament d'aquest projecte, vaig treballar com un dels programadors de Coffee Engine, contribuint a diversos **sistemes clau** tant del motor com del joc.\n\nVaig ser responsable de la implementació de mòduls essencials, incloent-hi:\n\n- **Mòdul d'Àudio**: Integrant Wwise amb àudio 3D, gestió de so basada en esdeveniments, RTCPs, busos auxiliars i suport de perfilador.\n- **Sistema d'Animació**: Suport per a animacions esquelètiques, blending i blending parcial.\n- **Mòdul d'UI**: Inclou funcions com ancoratges, stretching, maneig de transformacions, personalització de colors i animació de spritesheets. Admet diversos elements d'interfície com imatges, botons, toggles, sliders i text, proporcionant un flux de treball flexible i dinàmic per a la creació d'UI.\n- **Sistema de Navegació**: Genera malles de navegació a partir de geometria i ofereix algorismes de pathfinding, accessibles a través de scripting per facilitar la integració en el joc.\n\nEn el costat del joc, vaig desenvolupar el **Sistema de Guardat i Càrrega**, incloent-hi la gestió de punts de control i dades de guardat persistents. També vaig desenvolupar mecàniques interactives com portes i palanques.\n\nMés enllà del desenvolupament de funcions, em vaig centrar en l'**optimització del rendiment** tant per al motor com per al joc. Això va implicar l'ús d'eines com Tracy Profiler, l'optimització de frustum culling i altres sistemes, a més de millorar el rendiment dels recursos, assets i scripts. També vaig participar activament en **revisions de codi**.\n\nAl llarg del projecte, vaig oferir suport continu per a la **correcció d'errors** en múltiples sistemes del motor i scripts del joc, assegurant estabilitat i poliment en el joc final."
    }
  },

  "skills": ["C#", "Unity", "Engine Programming", "Audio Integration"],
   "picfoot": ["Animation","Pathfinding","UI","Wwise"],
  "pics": ["guillem_alqueza1.mp4","guillem_alqueza2.mp4","guillem_alqueza3.mp4","guillem_alqueza4.mp4"]
}